/*Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное
на само себя).

Например:
4 -> 16
-3 -> 9
-7 -> 49
*/

Console.WriteLine("Введите первое число");
string numberStr = Console.ReadLine();
int a = Convert.ToInt32(numberStr); 

Console.WriteLine("Введите второе число");
string numberStr = Console.ReadLine();
int b = Convert.ToInt32(numberStr); 

int c = 


Console.WriteLine($"квадрат числа {number} = {result}");
Console.WriteLine("квадрат числа " + number + " = " + result);
Console.WriteLine("квадрат числа {0} = {1}", number, result);
Console.WriteLine("квадрат числа {number} = {result}");